[
  {
    "id": "bees",
    "period": "2023 - Current",
    "title": "Tech Leader",
    "company": "BEES - AB-Inbev",
    "image": {
      "src": "/assets/images/bees-company.png",
      "alt": "BEES - AB-Inbev"
    },
    "summaryIntro": "At BEES (AB InBev), I contributed significantly to the development of global digital platforms. My achievements include:",
    "highlights": [
      "Standardized BFF architecture using NestJS and Clean Architecture, resolving frontend-backend dependencies. This approach, combined with WireMock, enabled parallel development and decoupled data processing from legacy contracts.",
      "Acted as Cross-Product Tech Lead (Grow, Force, Control Tower), defining MVVM patterns and elevating the team's technical bar through Code Reviews and Pair Programming.",
      "Architected the global ecosystem using Single-SPA and Module Federation, scaling to 10+ MFEs and 5 BFFs across 22 countries, significantly reducing bootstrap time for new services.",
      "Engineered proactive observability with New Relic and custom Bundle Analyzers, enabling real-time detection of performance issues correlated with user environments (browser versions, network conditions) before they impact end-users.",
      "Expanded technical scope to the Backend, supporting the team with Java and Spring."
    ]
  },
  {
    "id": "aurem",
    "period": "2018 - 2023",
    "title": "Founder & Software Engineer",
    "company": "Aurem",
    "image": {
      "src": "/assets/images/aurem-company.jpeg",
      "alt": "Aurem"
    },
    "summaryIntro": "As Founder, I led the development of an inclusive real-time captioning application, driving accessibility through speech recognition technologies. In 2019, I was awarded the Empreenda Santander Prize, a national recognition for impactful entrepreneurship. My main technical achievements include:",
    "highlights": [
      "Engineered a low-latency transcription engine leveraging the Web Speech API for client-side processing. This architecture eliminated backend bottlenecks, ensuring near-instantaneous speech-to-text conversion and reducing server costs.",
      "Developed a real-time synchronization system using WebSockets, enabling the simultaneous broadcast of subtitles to multiple connected clients across Web and Desktop environments with minimal delay.",
      "Architected a multi-platform ecosystem with React and Electron, achieving approximately 80% code reuse between web and desktop applications. This strategy enabled the delivery of the 'Floating Captions' feature, essential for accessibility overlay on top of other software.",
      "Deployed the infrastructure on AWS using Docker for environment standardization. The solution served over 1,000 students across major universities (Unicamp, USF, Inatel) and supported live events like Hack Town (200+ attendees), directly impacting inclusion during the pandemic."
    ]
  },
  {
    "id": "verzel",
    "period": "2021 - 2022",
    "title": "UX Designer",
    "company": "Verzel Soluções em Sistemas",
    "image": {
      "src": "/assets/images/verzel-company.png",
      "alt": "Verzel Soluções em Sistemas"
    },
    "summaryIntro": "At Verzel, I bridged the gap between design and engineering, creating digital solutions for the Web3 and Mobility sectors. My contributions include:",
    "highlights": [
      "Designed developer-friendly interfaces using Figma and Auto Layout, structuring prototypes with component variants that mirror React architecture to ensure technical feasibility.",
      "Streamlined the handoff process by creating Design Tokens and Style Guides, delivering ready-to-code assets that facilitated accurate implementation by the frontend team."
    ]
  },
  {
    "id": "neoenergia",
    "period": "2021",
    "title": "Software Developer Intern",
    "company": "Neoenergia",
    "image": {
      "src": "/assets/images/neoenergia-company.png",
      "alt": "Neoenergia"
    },
    "summaryIntro": "At Neoenergia (Agility Team), I worked on the digital transformation of internal processes, replacing manual workflows with custom software solutions. My main contributions include:",
    "highlights": [
      "Developed custom dashboards and smart data entry forms from scratch using React and TypeScript, replacing legacy Excel spreadsheets and Google Forms for field and management teams.",
      "Built a reusable UI Component Library, which was adopted by other squads to ensure design consistency and accelerate the development of internal tools.",
      "Collaborated on backend maintenance using Node.js and SQL Server, handling REST APIs and writing raw SQL queries to support data visualization features."
    ]
  }
]
